_posts/technology/2023-03-04-cppcoreguidelines-r37.html
---
layout: post
title: CppCoreGuidelines R.37 不要以指针或引用的方式传递智能指针的别名
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Do not pass a pointer or reference obtained from an aliased smart pointer&rdquo;
</p>


<p>
理由
</p>

<p>
违背此规则是导致引用计数丢失的首要原因。你会遇到悬挂指针问题。函数调用链中应该首选原始指针或引用。在调用链顶层，从智能指针获取原始指针或引用。智能指针用来记录对象是否存活。同时，你得保证在函数调用链中，智能指针不会不小心重置或重新赋值。
</p>


<p>
注意
</p>

<p>
有时候，你需要保存智能指针的一份本地副本，这个副本可以确保在函数调用期间对象不会删除。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">global (static or heap), or aliased local ...</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">shared_ptr</span><span style="color: #707183;">&lt;</span>widget<span style="color: #707183;">&gt;</span> <span style="color: #000000;">g_p</span> = ...;

<span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">f</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>&amp; <span style="color: #000000;">w</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    g<span style="color: #7388d6;">()</span>;
    use<span style="color: #7388d6;">(</span>w<span style="color: #7388d6;">)</span>;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">A</span>
<span style="color: #707183;">}</span>

<span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">g</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    g_p = ...; <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">oops, if this was the last shared_ptr to that widget, destroys the widget</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
以下代码有问题：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">my_code</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD: passing pointer or reference obtained from a non-local smart pointer</span>
    <span style="color: #3F7F5F;">//      </span><span style="color: #3F7F5F;">that could be inadvertently reset somewhere inside f or its callees</span>
    f<span style="color: #7388d6;">(</span>*g_p<span style="color: #7388d6;">)</span>;

    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD: same reason, just passing it as a "this" pointer</span>
    g_p-&gt;func<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
修改方法也很简单，只要本地复制一份指针，在调用树中保持引用计数。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">my_code</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">cheap: 1 increment covers this entire function and all the call trees below us</span>
    <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">pin</span> = g_p;

    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">GOOD: passing pointer or reference obtained from a local unaliased smart pointer</span>
    f<span style="color: #7388d6;">(</span>*pin<span style="color: #7388d6;">)</span>;

    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">GOOD: same reason</span>
    pin-&gt;func<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
强化
</p>
<ul class="org-ul">
<li>警告：从非局部的一个智能指针获取的指针/引用或者局部但可能是个别名的指针，用在了函数调用中。如果智能指针是一个共享指针，那么建议获取一份局部副本，并从那个副本获取指针或引用来使用。</li>
</ul>
